ddng/setRecordListRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:ddengi" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns2="http://xml.apache.org/xml-soap" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Body><ns1:setRecordList><apiId xsi:type="xsd:string">demo_api</apiId><login xsi:type="xsd:string">demo@example.com</login><pass xsi:type="xsd:string">demo</pass><list SOAP-ENC:arrayType="ns2:Map[7]" xsi:type="SOAP-ENC:Array"><item xsi:type="ns2:Map"><item><key xsi:type="xsd:string">server_id</key><value xsi:type="xsd:int">53131</value></item><item><key xsi:type="xsd:string">place_id</key><value xsi:type="xsd:int">40034</value></item><item><key xsi:type="xsd:string">budget_object_id</key><value xsi:type="xsd:int">40024</value></item><item><key xsi:type="xsd:string">sum</key><value xsi:type="xsd:int">14901</value></item><item><key xsi:type="xsd:string">operation_date</key><value xsi:type="xsd:string">2010-12-14 12:58:00</value></item><item><key xsi:type="xsd:string">comment</key><value xsi:type="xsd:string">Объект "A" №10</value></item><item><key xsi:type="xsd:string">currency_id</key><value xsi:type="xsd:int">20</value></item><item><key xsi:type="xsd:string">is_duty</key><value xsi:type="xsd:boolean">false</value></item><item><key xsi:type="xsd:string">operation_type</key><value xsi:type="xsd:int">2</value></item></item><item xsi:type="ns2:Map"><item><key xsi:type="xsd:string">client_id</key><value xsi:type="xsd:int">11111</value></item><item><key xsi:type="xsd:string">place_id</key><value xsi:type="xsd:int">40034</value></item><item><key xsi:type="xsd:string">budget_object_id</key><value xsi:type="xsd:int">40012</value></item><item><key xsi:type="xsd:string">sum</key><value xsi:type="xsd:int">20000</value></item><item><key xsi:type="xsd:string">operation_date</key><value xsi:type="xsd:string">2010-12-14 13:58:00</value></item><item><key xsi:type="xsd:string">comment</key><value xsi:type="xsd:string">Объект "A" №11</value></item><item><key xsi:type="xsd:string">currency_id</key><value xsi:type="xsd:int">17</value></item><item><key xsi:type="xsd:string">is_duty</key><value xsi:type="xsd:boolean">false</value></item><item><key xsi:type="xsd:string">operation_type</key><value xsi:type="xsd:int">3</value></item></item><item xsi:type="ns2:Map"><item><key xsi:type="xsd:string">client_id</key><value xsi:type="xsd:int">22222</value></item><item><key xsi:type="xsd:string">place_id</key><value xsi:type="xsd:int">40034</value></item><item><key xsi:type="xsd:string">budget_object_id</key><value xsi:type="xsd:int">40025</value></item><item><key xsi:type="xsd:string">sum</key><value xsi:type="xsd:int">35000</value></item><item><key xsi:type="xsd:string">operation_date</key><value xsi:type="xsd:string">2010-12-14 14:58:00</value></item><item><key xsi:type="xsd:string">comment</key><value xsi:type="xsd:string">Объект "A" №12</value></item><item><key xsi:type="xsd:string">currency_id</key><value xsi:type="xsd:int">17</value></item><item><key xsi:type="xsd:string">is_duty</key><value xsi:type="xsd:boolean">true</value></item><item><key xsi:type="xsd:string">operation_type</key><value xsi:type="xsd:int">3</value></item></item><item xsi:type="ns2:Map"><item><key xsi:type="xsd:string">client_id</key><value xsi:type="xsd:int">33333</value></item><item><key xsi:type="xsd:string">place_id</key><value xsi:type="xsd:int">40034</value></item><item><key xsi:type="xsd:string">budget_object_id</key><value xsi:type="xsd:int">41439</value></item><item><key xsi:type="xsd:string">sum</key><value xsi:type="xsd:int">1234</value></item><item><key xsi:type="xsd:string">operation_date</key><value xsi:type="xsd:string">2010-12-14 14:58:00</value></item><item><key xsi:type="xsd:string">comment</key><value xsi:type="xsd:string">Объект "A" №13</value></item><item><key xsi:type="xsd:string">currency_id</key><value xsi:type="xsd:int">17</value></item><item><key xsi:type="xsd:string">is_duty</key><value xsi:type="xsd:boolean">false</value></item><item><key xsi:type="xsd:string">operation_type</key><value xsi:type="xsd:int">4</value></item></item><item xsi:type="ns2:Map"><item><key xsi:type="xsd:string">client_id</key><value xsi:type="xsd:int">44444</value></item><item><key xsi:type="xsd:string">client_move_id</key><value xsi:type="xsd:int">33333</value></item><item><key xsi:type="xsd:string">place_id</key><value xsi:type="xsd:int">41439</value></item><item><key xsi:type="xsd:string">budget_object_id</key><value xsi:type="xsd:int">40034</value></item><item><key xsi:type="xsd:string">sum</key><value xsi:type="xsd:int">-1234</value></item><item><key xsi:type="xsd:string">operation_date</key><value xsi:type="xsd:string">2010-12-14 14:58:00</value></item><item><key xsi:type="xsd:string">comment</key><value xsi:type="xsd:string">Объект "A" №13</value></item><item><key xsi:type="xsd:string">currency_id</key><value xsi:type="xsd:int">17</value></item><item><key xsi:type="xsd:string">is_duty</key><value xsi:type="xsd:boolean">false</value></item><item><key xsi:type="xsd:string">operation_type</key><value xsi:type="xsd:int">4</value></item></item><item xsi:type="ns2:Map"><item><key xsi:type="xsd:string">client_id</key><value xsi:type="xsd:int">55555</value></item><item><key xsi:type="xsd:string">place_id</key><value xsi:type="xsd:int">40034</value></item><item><key xsi:type="xsd:string">budget_object_id</key><value xsi:type="xsd:int">40034</value></item><item><key xsi:type="xsd:string">sum</key><value xsi:type="xsd:int">3000</value></item><item><key xsi:type="xsd:string">operation_date</key><value xsi:type="xsd:string">2010-12-15 14:58:00</value></item><item><key xsi:type="xsd:string">comment</key><value xsi:type="xsd:string">Объект "A" №14</value></item><item><key xsi:type="xsd:string">currency_id</key><value xsi:type="xsd:int">18</value></item><item><key xsi:type="xsd:string">is_duty</key><value xsi:type="xsd:boolean">false</value></item><item><key xsi:type="xsd:string">operation_type</key><value xsi:type="xsd:int">5</value></item></item><item xsi:type="ns2:Map"><item><key xsi:type="xsd:string">client_id</key><value xsi:type="xsd:int">66666</value></item><item><key xsi:type="xsd:string">client_change_id</key><value xsi:type="xsd:int">55555</value></item><item><key xsi:type="xsd:string">place_id</key><value xsi:type="xsd:int">40034</value></item><item><key xsi:type="xsd:string">budget_object_id</key><value xsi:type="xsd:int">40034</value></item><item><key xsi:type="xsd:string">sum</key><value xsi:type="xsd:int">-100000</value></item><item><key xsi:type="xsd:string">operation_date</key><value xsi:type="xsd:string">2010-12-15 14:58:00</value></item><item><key xsi:type="xsd:string">comment</key><value xsi:type="xsd:string">Объект "A" №14</value></item><item><key xsi:type="xsd:string">currency_id</key><value xsi:type="xsd:int">17</value></item><item><key xsi:type="xsd:string">is_duty</key><value xsi:type="xsd:boolean">false</value></item><item><key xsi:type="xsd:string">operation_type</key><value xsi:type="xsd:int">5</value></item></item></list></ns1:setRecordList></SOAP-ENV:Body></SOAP-ENV:Envelope>
